jrowberg/i2cdevlib/MSP430/I2Cdev/I2Cdev.cpp
//        //Specify slave address
//		I2C_setSlaveAddress(devAddr);
//
//		//Set in transmit mode
//		I2C_setMode(I2C_TRANSMIT_MODE);
//
//		//Enable I2C Module to start operations
//		I2C_enable();
//
//		//Enable TX interrupt
//		I2C_enableInterrupt(I2C_TRANSMIT_INTERRUPT);
//
//		//Set transmit length
//		TXLENGTH = 1;
//		//Load TX byte counter
//		transmitCounter = 1;
//		transmitData[0] = regAddr;
//
//		//Initiate start and send first character
//		I2C_masterMultiByteSendStart(transmitData[0]);
//
//		//Delay until transmission completes
//		while (I2C_isBusBusy()) ;
//todo implement

    #endif
    for (uint8_t i = 0; i < length * 2; i++) {
        #if ((I2CDEV_IMPLEMENTATION == I2CDEV_ARDUINO_WIRE && ARDUINO < 100) || I2CDEV_IMPLEMENTATION == I2CDEV_BUILTIN_NBWIRE)
            Wire.send((uint8_t)(data[i++] >> 8)); // send MSB
            Wire.send((uint8_t)data[i]);          // send LSB
        #elif (I2CDEV_IMPLEMENTATION == I2CDEV_ARDUINO_WIRE && ARDUINO >= 100)
            Wire.write((uint8_t)(data[i++] >> 8)); // send MSB
            Wire.write((uint8_t)data[i]);          // send LSB
        #elif (I2CDEV_IMPLEMENTATION == I2CDEV_BUILTIN_FASTWIRE)
            status = Fastwire::write(devAddr, regAddr, (uint8_t)(data[i++] >> 8));
            status = Fastwire::write(devAddr, regAddr + 1, (uint8_t)data[i]);
		#elif (I2CDEV_IMPLEMENTATION == I2CDEV_MSP430)


//    		//Set transmit length
//    		TXLENGTH = 2;
//    		//Load TX byte counter
//    		transmitCounter = 1;
//    		transmitData[0] = (uint8_t)(data[i++] >> 8);
//    		transmitData[1] = (uint8_t)(data[i++]);
//
//    		//Initiate start and send first character
//    		I2C_masterMultiByteSendStart(transmitData[0]);
//
//    		//Delay until transmission completes
//    		while (I2C_isBusBusy()) ;

        #endif
        #ifdef I2CDEV_SERIAL_DEBUG
            Serial.print(data[i], HEX);
            if (i + 1 < length) Serial.print(" ");
        #endif
    }
    #if ((I2CDEV_IMPLEMENTATION == I2CDEV_ARDUINO_WIRE && ARDUINO < 100) || I2CDEV_IMPLEMENTATION == I2CDEV_BUILTIN_NBWIRE)
        Wire.endTransmission();
    #elif (I2CDEV_IMPLEMENTATION == I2CDEV_ARDUINO_WIRE && ARDUINO >= 100)
        status = Wire.endTransmission();
	#elif (I2CDEV_IMPLEMENTATION == I2CDEV_MSP430)
//    	//Delay until transmission completes
//    	while (I2C_isBusBusy()) ;
//
//    	//Disable TX interrupt
//    	I2C_disableInterrupt(I2C_TRANSMIT_INTERRUPT);
//    	//Disable I2C Module to stop operations
//    	I2C_disable();
    #endif
    #ifdef I2CDEV_SERIAL_DEBUG
        Serial.println(". Done.");
    #endif
    return status == 0;
}

/** Default timeout value for read operations.
 * Set this to 0 to disable timeout detection.
 */
uint16_t I2Cdev::readTimeout = I2CDEV_DEFAULT_READ_TIMEOUT;

#if I2CDEV_IMPLEMENTATION == I2CDEV_BUILTIN_FASTWIRE
    /*
    FastWire 0.2
    This is a library to help faster programs to read I2C devices.
    Copyright(C) 2011 Francesco Ferrara
    occhiobello at gmail dot com
    */

    boolean Fastwire::waitInt() {
        int l = 250;
        while (!(TWCR & (1 << TWINT)) && l-- > 0);
        return l > 0;
    }

    void Fastwire::setup(int khz, boolean pullup) {
        TWCR = 0;
        #if defined(__AVR_ATmega168__) || defined(__AVR_ATmega8__) || defined(__AVR_ATmega328P__)
            // activate internal pull-ups for twi (PORTC bits 4 & 5)
            // as per note from atmega8 manual pg167
            if (pullup) PORTC |= ((1 << 4) | (1 << 5));
            else        PORTC &= ~((1 << 4) | (1 << 5));
        #elif defined(__AVR_ATmega644P__) || defined(__AVR_ATmega644__)
            // activate internal pull-ups for twi (PORTC bits 0 & 1)
            if (pullup) PORTC |= ((1 << 0) | (1 << 1));
            else        PORTC &= ~((1 << 0) | (1 << 1));
        #else
            // activate internal pull-ups for twi (PORTD bits 0 & 1)
            // as per note from atmega128 manual pg204
            if (pullup) PORTD |= ((1 << 0) | (1 << 1));
            else        PORTD &= ~((1 << 0) | (1 << 1));
        #endif

        TWSR = 0; // no prescaler => prescaler = 1
        TWBR = ((16000L / khz) - 16) / 2; // change the I2C clock rate
        TWCR = 1 << TWEN; // enable twi module, no interrupt
    }

    byte Fastwire::write(byte device, byte address, byte value) {
        byte twst, retry;

        retry = 2;
        do {
            TWCR = (1 << TWINT) | (1 << TWEN) | (1 << TWSTO) | (1 << TWSTA);
            if (!waitInt()) return 1;
            twst = TWSR & 0xF8;
            if (twst != TW_START && twst != TW_REP_START) return 2;

            TWDR = device & 0xFE; // send device address without read bit (1)
            TWCR = (1 << TWINT) | (1 << TWEN);
            if (!waitInt()) return 3;
            twst = TWSR & 0xF8;
        } while (twst == TW_MT_SLA_NACK && retry-- > 0);
        if (twst != TW_MT_SLA_ACK) return 4;

        TWDR = address; // send data to the previously addressed device
        TWCR = (1 << TWINT) | (1 << TWEN);
        if (!waitInt()) return 5;
        twst = TWSR & 0xF8;
        if (twst != TW_MT_DATA_ACK) return 6;

        TWDR = value; // send data to the previously addressed device
        TWCR = (1 << TWINT) | (1 << TWEN);
        if (!waitInt()) return 7;
        twst = TWSR & 0xF8;
        if (twst != TW_MT_DATA_ACK) return 8;

        return 0;
    }

    byte Fastwire::readBuf(byte device, byte address, byte *data, byte num) {
        byte twst, retry;

        retry = 2;
        do {
            TWCR = (1 << TWINT) | (1 << TWEN) | (1 << TWSTO) | (1 << TWSTA);
            if (!waitInt()) return 16;
            twst = TWSR & 0xF8;
            if (twst != TW_START && twst != TW_REP_START) return 17;

            TWDR = device & 0xfe; // send device address to write
            TWCR = (1 << TWINT) | (1 << TWEN);
            if (!waitInt()) return 18;
            twst = TWSR & 0xF8;
        } while (twst == TW_MT_SLA_NACK && retry-- > 0);
        if (twst != TW_MT_SLA_ACK) return 19;

        TWDR = address; // send data to the previously addressed device
        TWCR = (1 << TWINT) | (1 << TWEN);
        if (!waitInt()) return 20;
        twst = TWSR & 0xF8;
        if (twst != TW_MT_DATA_ACK) return 21;

        /***/

